Documents/УдалитьРассылка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>УдалитьРассылка</Name>
			<Comment>Трейд Софт</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СостоянияПоАвтоинформированию</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДействийДляСкоринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстаДляАвтоинформирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНаВыполнение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиSMS4B</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеДанныеЗаполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыРассылки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДоставлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОтправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноПолучено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОпределен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочитано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИстекСрокОжидания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыДействийДляСкоринга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыДействийДляСкоринга</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизвольноеДействие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMSОповещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГолосовоеСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EMailРассылка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапускБП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеБП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УдалитьРассылка/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборЗаписей = РегистрыСведений.ЗаданияДляРассылки.СоздатьНаборЗаписей();
	Для Каждого Элемент ИЗ ЭтотОбъект.Объекты Цикл	
		Если ЗначениеЗаполнено(Элемент.Контакт) И ЗначениеЗаполнено(Элемент.Текст) Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Автор = ЭтотОбъект.Ссылка;
			Запись.Номер = Элемент.НомерСтроки;
			Запись.Объект = Элемент.Объект;
			Запись.Действие = ЭтотОбъект.Действие;
			Запись.Контакт = Элемент.Контакт;
			Запись.Текст = Элемент.Текст;
			Запись.Статус = Перечисления.СтатусыРассылки.НеОпределен;
			//		Запись.ТекстовыйСтатус = "Не отправлено";
			Запись.Шаблон = ЭтотОбъект.Шаблон;
			Запись.Дата = ЭтотОбъект.Дата + ЭтотОбъект.ДнейНаВыполнение * 3600 * 24;
			Запись.GUID = Строка(Новый УникальныйИдентификатор);
			Если ЭтотОбъект.УчетнаяЗаписьОтправителя = Справочники.УчетныеЗаписиSMS4B.ПустаяСсылка() ИЛИ ЭтотОбъект.УчетнаяЗаписьОтправителя = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка() Тогда
				Если ЭтотОбъект.Действие = Перечисления.ВариантыДействийДляСкоринга.SMSОповещение Тогда
					Запись.Отправитель = Константы.УчеткаSMSРассылок.Получить();
				ИначеЕсли ЭтотОбъект.Действие = Перечисления.ВариантыДействийДляСкоринга.EMailРассылка Тогда
					Запись.Отправитель = Константы.УчеткаEMailРассылок.Получить();
				КонецЕсли;
			Иначе
				Запись.Отправитель = ЭтотОбъект.УчетнаяЗаписьОтправителя;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	НаборЗаписей.Записать(Ложь);

КонецПроцедуры

Процедура ОтправитьEMailСообщение(Почта, УчеткаEmail, ТекстСообщения)
	Письмо = Новый ИнтернетПочтовоеСообщение();
	Письмо.Тема = "ЖЖЖ"; 
	Текст = Письмо.Тексты.Добавить(ТекстСообщения);
	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Письмо.ИмяОтправителя = "ППП";
	Письмо.Отправитель.ОтображаемоеИмя = "ФФФ"; 
	Письмо.Получатели.Добавить("san_pancho@mail.ru");
	
	Почта.Послать(Письмо);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//Если Не Действие.Пустая() ИЛИ Не ВидКИ.Пустая() ИЛИ Не Шаблон.Пустая() Тогда
	//	ТЗ = Объекты.Выгрузить();
	//	Если Не Действие.Пустая() Тогда
	//		ТЗ.ЗаполнитьЗначения(Действие, "Действие");		
	//	КонецЕсли;	
	//	Если Не ЭтотОбъект.ВидКИ.Пустая() Тогда
	//		ТЗ.ЗаполнитьЗначения(ВидКИ, "ВидКИ");
	//	КонецЕсли;	
	//	Если Не ЭтотОбъект.Шаблон.Пустая() Тогда
	//		ТЗ.ЗаполнитьЗначения(Шаблон, "Шаблон");
	//	КонецЕсли;	
	//	Объекты.Загрузить(ТЗ);
	//КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)	
	ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтотОбъект.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Отказ = Истина; 
	КонецЕсли;
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		НаборЗаписей = РегистрыСведений.ЗаданияДляРассылки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Автор.Установить(ЭтотОбъект.Ссылка);
		НаборЗаписей.Прочитать();
		ЧислоЗаписей = НаборЗаписей.Количество();
		НаборЗаписей.Отбор.Статус.Установить(Перечисления.СтатусыРассылки.НеОпределен);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > ЧислоЗаписей Тогда
			Сообщить("По данному документу уже началась рассылка");
			Отказ = Истина;
		Иначе
			НаборЗаписей = РегистрыСведений.ЗаданияДляРассылки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Автор.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
	КонецЕсли;
	ЭтотОбъект.ВсеДанныеЗаполнены = Истина;
	Для Каждого Элемент из ЭтотОбъект.Объекты Цикл
		Если Не ЗначениеЗаполнено(Элемент.Текст) ИЛИ Не ЗначениеЗаполнено(Элемент.Контакт) Тогда
			ЭтотОбъект.ВсеДанныеЗаполнены = Ложь;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
